tutorials/heatTransfer/chtMultiRegionSimpleFoam/externalCoupledHeater/system/externalCoupled
// -*- C++ -*-

// control for external coupled simulation
externalCoupled
{
    libs    ("libfieldFunctionObjects.so");

    type    externalCoupled;

    // Directory to use for communication
    commsDir        "${FOAM_CASE}/comms";

    // Does external process start first
    initByExternal  true;

    // Frequency of coupling
    calcFrequency   4;

    // Additional output
    log             true;

    regions
    {
        // Region name (wildcards allowed)
        "(topAir|heater)"
        {
            // In topAir adjust the minX patch (fixedValue)

            // Patch or patchGroup
            coupleGroup
            {
                // Fields to output in commsDir
                writeFields (T);
                // Fields to read from commsDir
                readFields  (T);
            }
        }
    }
}


// ************************************************************************* //
